In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
myindex =  ['USA','Canada','Mexico']

In [5]:
mydata = [1776, 1867 , 1821]

In [6]:
myser = pd.Series(data = mydata)

In [7]:
myser

0    1776
1    1867
2    1821
dtype: int64

In [8]:
# creating series

In [9]:
myser = pd.Series(data = mydata , index = myindex )

In [10]:
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [11]:
# we can also create Pandas series from Dictionary

In [12]:
ages = {'Sam': 5 , 'Frank': 10 , 'Spike': 7}
# if we pass ages as data then pandas will visualize keys as the index

In [13]:
pd.Series(ages)

Sam       5
Frank    10
Spike     7
dtype: int64

In [14]:
q1 = {'Japan':80 , 'China':450 , 'India':200}

In [15]:
q2 = {'Brasil':100, 'China':450 ,'India':200}

In [16]:
sales_q1 = pd.Series(q1)

In [17]:
sales_q2 = pd.Series(q2)

In [18]:
# Suppose if we want to list all the avilable keys in a large dataset then we can do

In [19]:
sales_q1.keys()

Index(['Japan', 'China', 'India'], dtype='object')

In [20]:
# If there is a list [1,2] & we want to muntiply each list item by 2 then:

In [21]:
[1,2] *2
# it doesnt work but if it is a numpy array then it will work.

[1, 2, 1, 2]

In [22]:
np.array([1,2]) * 2

array([2, 4])

In [23]:
# since sales_q1 pandas service built by numpy operation it will work
sales_q1

Japan     80
China    450
India    200
dtype: int64

In [24]:
sales_q1 * 2

Japan    160
China    900
India    400
dtype: int64

In [25]:
# NAN
final = sales_q1 + sales_q2
# Both Brasil and Japan arent present in both q1, q2  So it returns NAN.

In [26]:
 # handeling of NAN
sales_q1.add(sales_q2 , fill_value = 0)

Brasil    100.0
China     900.0
India     400.0
Japan      80.0
dtype: float64

In [27]:
#final.fillna()
#final.dropna()

In [28]:
#Dataframe
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [29]:
mycolumns = ['Jan','Feb','Mar']
myindex =  ['CA','NY','AZ','TX']
# Now we are going to create  df manually

In [30]:
df = pd.DataFrame(mydata)

In [31]:
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [32]:
df = pd.DataFrame(mydata,myindex)

In [33]:
df

     0   1   2
CA  95  11  81
NY  70  63  87
AZ  75   9  77
TX  40   4  63

In [34]:
df = pd.DataFrame(mydata,myindex,mycolumns)

In [35]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [37]:
# conditional filtering